Install required libraries:

In [ ]:
!pip install sqlalchemy psycopg2-binary ipython-sql xlrd

Load the sql extension and connect to the PostgreSQL database:

In [ ]:
%load_ext sql
%sql postgresql://postgres:accident_analysis@localhost:5432/claims_analysis

Create normalized tables:

In [ ]:
%%sql

CREATE TABLE IF NOT EXISTS Car_Use (
    car_use_id SERIAL PRIMARY KEY,
    caruse VARCHAR
);

CREATE TABLE IF NOT EXISTS Car_Type (
    car_type_id SERIAL PRIMARY KEY,
    cartype VARCHAR
);

CREATE TABLE IF NOT EXISTS Red_Car (
    red_car_id SERIAL PRIMARY KEY,
    redcar VARCHAR
);

CREATE TABLE IF NOT EXISTS Revoked (
    revoked_id SERIAL PRIMARY KEY,
    revoked VARCHAR
);

CREATE TABLE IF NOT EXISTS Claim_Flag (
    claim_flag_id SERIAL PRIMARY KEY,
    claimflag VARCHAR
);

CREATE TABLE IF NOT EXISTS Age (
    age_id SERIAL PRIMARY KEY,
    age VARCHAR
);

CREATE TABLE IF NOT EXISTS Married (
    married_id SERIAL PRIMARY KEY,
    married VARCHAR
);

CREATE TABLE IF NOT EXISTS Gender (
    gender_id SERIAL PRIMARY KEY,
    gender VARCHAR
);

CREATE TABLE IF NOT EXISTS Parent1 (
    parent1_id SERIAL PRIMARY KEY,
    parent1 VARCHAR
);

CREATE TABLE IF NOT EXISTS JobClass (
    jobclass_id SERIAL PRIMARY KEY,
    jobclass VARCHAR
);

CREATE TABLE IF NOT EXISTS Max_Education (
    max_edu_id SERIAL PRIMARY KEY,
    max_edu VARCHAR
);

CREATE TABLE IF NOT EXISTS Density (
    density_id SERIAL PRIMARY KEY,
    density VARCHAR
);

CREATE TABLE IF NOT EXISTS YearQTR (
    yearqtr_id SERIAL PRIMARY KEY,
    yearqtr VARCHAR
);

CREATE TABLE IF NOT EXISTS Customer (
    customer_id SERIAL PRIMARY KEY,
    age_id INT,
    income VARCHAR,
    gender_id INT,
    married_id INT,
    parent1_id INT,
    jobclass_id INT,
    max_edu_id INT,
    density_id INT,
    home_val VARCHAR,
    same_home FLOAT
);

CREATE TABLE IF NOT EXISTS insurance_policy (
    policy_id SERIAL PRIMARY KEY,
    customer_id INT,
    yearqtr_id INT,
    policyNo INT,
    revoked_id INT,
    policydate VARCHAR,
    initdate VARCHAR,
    retained INT,
    npolicy INT,
    kidsDriv INT
);

CREATE TABLE IF NOT EXISTS vehicles (
    vehicle_id SERIAL PRIMARY KEY,
    customer_id INT,
    car_use_id INT,
    red_car_id INT,
    car_type_id INT,
    bluebook VARCHAR
);

CREATE TABLE IF NOT EXISTS claims (
    claim_id SERIAL PRIMARY KEY,
    customer_id INT,
    claim_flag_id INT,
    old_claim VARCHAR,
    claim_freq INT,
    claim_amt VARCHAR,
    claim_date VARCHAR
);

CREATE TABLE IF NOT EXISTS travel_details (
    travel_id SERIAL PRIMARY KEY,
    customer_id INT,
    traveltime INT
);

Load the flat dataset:

In [103]:
import pandas as pd
csv_file_path = '/Users/tshmacm1173/Desktop/Sprint 5/claims_analysis/data.csv'
data = pd.read_csv(csv_file_path)

In [104]:
data.head()

,ID,KIDSDRIV,PLCYDATE,TRAVTIME,CAR_USE,POLICYNO,BLUEBOOK,INITDATE,RETAINED,NPOLICY,...,INCOME,GENDER,MARRIED,PARENT1,JOBCLASS,MAX_EDUC,HOME_VAL,SAMEHOME,DENSITY,YEARQTR
0,100058542,0,17mars96,17,Private,36292520,$9860,06février90,6,2,...,NaN,M,Yes,No,Clerical,<High School,$123721,7.0,Highly Urban,1996Q1
1,100093408,0,26juillet93,18,Private,31958061,$1500,25aoűt89,4,2,...,$4457,M,No,Yes,Student,High School,$0,1.0,Urban,1993Q3
2,100208113,0,06juin94,47,Commercial,42433312,$30460,07juin90,4,1,...,$102904,M,No,No,NaN,Masters,$0,18.0,Urban,1994Q2
3,100237269,0,19janvier99,31,Private,49896544,$16580,01avril95,4,2,...,$14554,F,Yes,No,Student,High School,$0,8.0,Rural,1999Q1
4,10042968,0,18mai99,14,Commercial,79298192,$23030,19mai95,4,1,...,$99493,F,Yes,No,Blue Collar,High School,$288808,1.0,Urban,1999Q2

In [105]:
data.shape

(10296, 33)

Create flat Table:

In [ ]:
%%sql


CREATE TABLE IF NOT EXISTS claims_analysis (
    "ID" INT,
    "KIDSDRIV" INT,
    "PLCYDATE" VARCHAR,
    "TRAVTIME" INT,
    "CAR_USE" VARCHAR,
    "POLICYNO" INT,
    "BLUEBOOK" VARCHAR,
    "INITDATE" VARCHAR,
    "RETAINED" INT,
    "NPOLICY" INT,
    "CAR_TYPE" VARCHAR,
    "RED_CAR" VARCHAR,
    "OLDCLAIM" VARCHAR,
    "CLM_FREQ" INT,
    "REVOKED" VARCHAR,
    "MVR_PTS" INT,
    "CLM_AMT" VARCHAR,
    "CLM_DATE" VARCHAR,
    "CLM_FLAG" VARCHAR,
    "BIRTH" VARCHAR,
    "AGE" VARCHAR,
    "HOMEKIDS" INT,
    "YOJ" FLOAT,
    "INCOME" VARCHAR,
    "GENDER" VARCHAR,
    "MARRIED" VARCHAR,
    "PARENT1" VARCHAR,
    "JOBCLASS" VARCHAR,
    "MAX_EDUC" VARCHAR,
    "HOME_VAL" VARCHAR,
    "SAMEHOME" FLOAT,
    "DENSITY" VARCHAR,
    "YEARQTR" VARCHAR
)

Insert data into the flat table:

In [ ]:
%%sql

SET datestyle TO 'ISO, DMY';

COPY claims_analysis(
    "ID",
    "KIDSDRIV",
    "PLCYDATE",
    "TRAVTIME",
    "CAR_USE",
    "POLICYNO",
    "BLUEBOOK",
    "INITDATE",
    "RETAINED",
    "NPOLICY",
    "CAR_TYPE",
    "RED_CAR",
    "OLDCLAIM",
    "CLM_FREQ",
    "REVOKED",
    "MVR_PTS",
    "CLM_AMT",
    "CLM_DATE",
    "CLM_FLAG",
    "BIRTH",
    "AGE",
    "HOMEKIDS",
    "YOJ",
    "INCOME",
    "GENDER",
    "MARRIED",
    "PARENT1",
    "JOBCLASS",
    "MAX_EDUC",
    "HOME_VAL",
    "SAMEHOME",
    "DENSITY",
    "YEARQTR"
)
FROM '/Users/tshmacm1173/Desktop/Sprint 5/claims_analysis/data.csv'
DELIMITER ','
CSV HEADER;

Insert data into normalized tables:

In [ ]:
%%sql

INSERT INTO Car_Use (caruse) 
SELECT DISTINCT "CAR_USE" FROM claims_analysis;

INSERT INTO Car_Type (cartype) 
SELECT DISTINCT "CAR_TYPE" FROM claims_analysis;

INSERT INTO Red_Car (redcar) 
SELECT DISTINCT "RED_CAR" FROM claims_analysis;

INSERT INTO Revoked (revoked) 
SELECT DISTINCT "REVOKED" FROM claims_analysis;

INSERT INTO Claim_Flag (claimflag) 
SELECT DISTINCT "CLM_FLAG" FROM claims_analysis;

INSERT INTO Age (age) 
SELECT DISTINCT "AGE" FROM claims_analysis;

INSERT INTO Married (married) 
SELECT DISTINCT "MARRIED" FROM claims_analysis;

INSERT INTO Gender (gender) 
SELECT DISTINCT "GENDER" FROM claims_analysis;

INSERT INTO Parent1 (parent1) 
SELECT DISTINCT "PARENT1" FROM claims_analysis;

INSERT INTO JobClass (jobclass) 
SELECT DISTINCT "JOBCLASS" FROM claims_analysis;

INSERT INTO Max_Education (max_edu) 
SELECT DISTINCT "MAX_EDUC" FROM claims_analysis;

INSERT INTO Density (density) 
SELECT DISTINCT "DENSITY" FROM claims_analysis;

INSERT INTO YearQTR (yearqtr) 
SELECT DISTINCT "YEARQTR" FROM claims_analysis;


INSERT INTO Customer (age_id, income, gender_id, married_id, parent1_id, jobclass_id, max_edu_id, density_id, home_val, same_home)
SELECT 
    a.age_id, ca."INCOME", g.gender_id, m.married_id, p.parent1_id, j.jobclass_id, e.max_edu_id, d.density_id, 
    ca."HOME_VAL", ca."SAMEHOME"
FROM claims_analysis ca
JOIN Age a ON ca."AGE" = a.age
JOIN Gender g ON ca."GENDER" = g.gender
JOIN Married m ON ca."MARRIED" = m.married
JOIN Parent1 p ON ca."PARENT1" = p.parent1
JOIN JobClass j ON ca."JOBCLASS" = j.jobclass
JOIN Max_Education e ON ca."MAX_EDUC" = e.max_edu
JOIN Density d ON ca."DENSITY" = d.density;


INSERT INTO insurance_policy (customer_id, yearqtr_id, policyNo, revoked_id, policydate, initdate, retained, npolicy, kidsDriv)
SELECT 
    c.customer_id, y.yearqtr_id, ca."POLICYNO", r.revoked_id, ca."PLCYDATE", ca."INITDATE", 
    ca."RETAINED", ca."NPOLICY", ca."KIDSDRIV"
FROM claims_analysis ca
JOIN Customer c ON ca."INCOME" = c.income -- Assuming unique income, otherwise use another key
JOIN YearQTR y ON ca."YEARQTR" = y.yearqtr
JOIN Revoked r ON ca."REVOKED" = r.revoked;


INSERT INTO vehicles (customer_id, car_use_id, red_car_id, car_type_id, bluebook)
SELECT 
    c.customer_id, cu.car_use_id, rc.red_car_id, ct.car_type_id, ca."BLUEBOOK"
FROM claims_analysis ca
JOIN Customer c ON ca."INCOME" = c.income
JOIN Car_Use cu ON ca."CAR_USE" = cu.caruse
JOIN Red_Car rc ON ca."RED_CAR" = rc.redcar
JOIN Car_Type ct ON ca."CAR_TYPE" = ct.cartype;


INSERT INTO claims (customer_id, claim_flag_id, old_claim, claim_freq, claim_amt, claim_date)
SELECT 
    c.customer_id, cf.claim_flag_id, ca."OLDCLAIM", ca."CLM_FREQ", ca."CLM_AMT", ca."CLM_DATE"
FROM claims_analysis ca
JOIN Customer c ON ca."INCOME" = c.income
JOIN Claim_Flag cf ON ca."CLM_FLAG" = cf.claimflag;


INSERT INTO travel_details (customer_id, traveltime)
SELECT 
    c.customer_id, ca."TRAVTIME"
FROM claims_analysis ca
JOIN Customer c ON ca."INCOME" = c.income;